{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fax/media/panashe/1956cdfa-4d1c-4d76-afd9-6d92c1e66202/UdacitySelfDrivingCarDegree/SDC-P3-BehavioralCloning-master/model.py\u00da\b<lambda>\u0096\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 64, 64, 3]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "activation": "linear", "trainable": true, "kernel_constraint": null, "use_bias": true, "filters": 24, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "activation": "linear", "trainable": true, "kernel_constraint": null, "use_bias": true, "filters": 36, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "data_format": "channels_last", "kernel_size": [5, 5], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "activation": "linear", "trainable": true, "kernel_constraint": null, "use_bias": true, "filters": 48, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "activation": "linear", "trainable": true, "kernel_constraint": null, "use_bias": true, "filters": 64, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv2d_5", "activation": "linear", "trainable": true, "kernel_constraint": null, "use_bias": true, "filters": 64, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 80, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_3", "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_4", "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_5", "activation": "linear", "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}], "keras_version": "2.0.6"}